IDEA Open Model
ConnectionSetup.WeldingTypeSNIP Property
Compatible with IDEA StatiCa Beta 20.0
 Welding types defined in SP16-Table 39
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public WeldingTypeSNIP WeldingTypeSNIP { get; set; }
Public Property WeldingTypeSNIP As WeldingTypeSNIP
	Get
	Set
Property Value
Type: WeldingTypeSNIP
See Also
Reference
ConnectionSetup Class
IdeaRS.OpenModel Namespace